avnet-iotconnect/iotc-stm32-n6-demos/Projects/Hand Landmarks/x-cube-n6-ai-hand-landmarks-v1.0.0/Src/app.c
 /**
 ******************************************************************************
 * @file    app.c
 * @author  MDG Application Team
 *
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2024 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

#include "app.h"

#include <stdint.h>
#include <stdio.h>

#include "app_cam.h"
#include "app_config.h"
#include "IPL_resize.h"
#include "app_postprocess.h"
#include "isp_api.h"
#include "ld.h"
#include "ll_aton_runtime.h"
#include "cmw_camera.h"
#include "stm32n6570_discovery_lcd.h"
#include "stm32n6570_discovery.h"
#include "stm32_lcd.h"
#include "stm32_lcd_ex.h"
#include "stm32n6xx_hal.h"
#include "tx_api.h"
#include "utils.h"

//iotc start
/* CPU Load and Neural Network Performance */
float iot_cpu_percentage = 0.0f;
float iot_nn_fps = 0.0f;
float iot_nn_period_ms = 0.0f;

/* Inference Execution Times */
float iot_pd_ms = 0.0f;   // Palm Detector execution time (ms)
float iot_hl_ms = 0.0f;   // Hand Landmark execution time (ms)
float iot_disp_ms = 0.0f; // Display update time (ms)

/* Hand Detection Variables */
int iot_hand_valid = 0;
int iot_pd_hand_nb = 0; // Number of hands detected
float iot_pd_max_prob = 0.0f; // Maximum confidence of detected hands
float iot_hand_x_center = 0.0f, iot_hand_y_center = 0.0f; 
float iot_hand_width = 0.0f, iot_hand_height = 0.0f;
float iot_hand_rotation = 0.0f;
/* Hand Gesture Classification */
char iot_classification[32] = "Unknown";


/* Hand Landmark Variables (21 Points) */
float iot_wrist_x = 0.0f, iot_wrist_y = 0.0f; // Palm base (wrist)

/* Thumb */
float iot_thumb_cmc_x = 0.0f, iot_thumb_cmc_y = 0.0f; // CMC Joint
float iot_thumb_mcp_x = 0.0f, iot_thumb_mcp_y = 0.0f; // MCP Joint
float iot_thumb_ip_x = 0.0f, iot_thumb_ip_y = 0.0f;   // IP Joint
float iot_thumb_tip_x = 0.0f, iot_thumb_tip_y = 0.0f; // Tip

/* Index Finger */
float iot_index_mcp_x = 0.0f, iot_index_mcp_y = 0.0f;
float iot_index_pip_x = 0.0f, iot_index_pip_y = 0.0f;
float iot_index_dip_x = 0.0f, iot_index_dip_y = 0.0f;
float iot_index_tip_x = 0.0f, iot_index_tip_y = 0.0f;

/* Middle Finger */
float iot_middle_mcp_x = 0.0f, iot_middle_mcp_y = 0.0f;
float iot_middle_pip_x = 0.0f, iot_middle_pip_y = 0.0f;
float iot_middle_dip_x = 0.0f, iot_middle_dip_y = 0.0f;
float iot_middle_tip_x = 0.0f, iot_middle_tip_y = 0.0f;

/* Ring Finger */
float iot_ring_mcp_x = 0.0f, iot_ring_mcp_y = 0.0f;
float iot_ring_pip_x = 0.0f, iot_ring_pip_y = 0.0f;
float iot_ring_dip_x = 0.0f, iot_ring_dip_y = 0.0f;
float iot_ring_tip_x = 0.0f, iot_ring_tip_y = 0.0f;

/* Pinky Finger */
float iot_pinky_mcp_x = 0.0f, iot_pinky_mcp_y = 0.0f;
float iot_pinky_pip_x = 0.0f, iot_pinky_pip_y = 0.0f;
float iot_pinky_dip_x = 0.0f, iot_pinky_dip_y = 0.0f;
float iot_pinky_tip_x = 0.0f, iot_pinky_tip_y = 0.0f;
//iotc end

#ifndef M_PI
#define M_PI 3.14159265358979323846
#endif

#define HAS_ROTATION_SUPPORT 0

#define LCD_FG_WIDTH LCD_BG_WIDTH
#define LCD_FG_HEIGHT LCD_BG_HEIGHT

#define CACHE_OP(__op__) do { \
  if (is_cache_enable()) { \
    __op__; \
  } \
} while (0)

#define DBG_INFO 0
#define USE_FILTERED_TS 1

#define BQUEUE_MAX_BUFFERS 2
#define CPU_LOAD_HISTORY_DEPTH 8

#define DISPLAY_BUFFER_NB (DISPLAY_DELAY + 2)

/* palm detector */
#define PD_MAX_HAND_NB 1

typedef struct {
  float cx;
  float cy;
  float w;
  float h;
  float rotation;
} roi_t;

typedef struct
{
  uint32_t X0;
  uint32_t Y0;
  uint32_t XSize;
  uint32_t YSize;
} Rectangle_TypeDef;

typedef struct {
  TX_SEMAPHORE free;
  TX_SEMAPHORE ready;
  int buffer_nb;
  uint8_t *buffers[BQUEUE_MAX_BUFFERS];
  int free_idx;
  int ready_idx;
} bqueue_t;

typedef struct {
  uint64_t current_total;
  uint64_t current_thread_total;
  uint64_t prev_total;
  uint64_t prev_thread_total;
  struct {
    uint64_t total;
    uint64_t thread;
    uint32_t tick;
  } history[CPU_LOAD_HISTORY_DEPTH];
} cpuload_info_t;

typedef struct {
  int is_valid;
  pd_pp_box_t pd_hands;
  roi_t roi;
  ld_point_t ld_landmarks[LD_LANDMARK_NB];
} hand_info_t;

typedef struct {
  float nn_period_ms;
  uint32_t pd_ms;
  uint32_t hl_ms;
  uint32_t pp_ms;
  uint32_t disp_ms;
  int is_ld_displayed;
  int is_pd_displayed;
  int pd_hand_nb;
  float pd_max_prob;
  hand_info_t hands[PD_MAX_HAND_NB];
} display_info_t;

typedef struct {
  TX_SEMAPHORE update;
  TX_MUTEX lock;
  display_info_t info;
} display_t;

typedef struct {
  uint32_t nn_in_len;
  float *prob_out;
  uint32_t prob_out_len;
  float *boxes_out;
  uint32_t boxes_out_len;
  pd_model_pp_static_param_t static_param;
  pd_postprocess_out_t pd_out;
} pd_model_info_t;

typedef struct {
  uint8_t *nn_in;
  uint32_t nn_in_len;
  float *prob_out;
  uint32_t prob_out_len;
  float *landmarks_out;
  uint32_t landmarks_out_len;
} hl_model_info_t;

typedef struct {
  Button_TypeDef button_id;
  int prev_state;
  void (*on_click_handler)(void *cb_args);
  void *cb_args;
} button_t;

/* Globals */
/* Lcd Background area */
static Rectangle_TypeDef lcd_bg_area = {
  .X0 = (LCD_DEFAULT_WIDTH - LCD_BG_WIDTH) / 2,
  .Y0 = (LCD_DEFAULT_HEIGHT - LCD_BG_HEIGHT) / 2,
  .XSize = LCD_BG_WIDTH,
  .YSize = LCD_BG_HEIGHT,
};
/* Lcd Foreground area */
static Rectangle_TypeDef lcd_fg_area = {
  .X0 = (LCD_DEFAULT_WIDTH - LCD_FG_WIDTH) / 2,
  .Y0 = (LCD_DEFAULT_HEIGHT - LCD_FG_HEIGHT) / 2,
  .XSize = LCD_FG_WIDTH,
  .YSize = LCD_FG_HEIGHT,
};
/* Lcd Background Buffer */
static uint8_t lcd_bg_buffer[DISPLAY_BUFFER_NB][LCD_BG_WIDTH * LCD_BG_HEIGHT * DISPLAY_BPP] ALIGN_32 IN_PSRAM;
static int lcd_bg_buffer_disp_idx = 1;
static int lcd_bg_buffer_capt_idx = 0;
/* Lcd Foreground Buffer */
static uint8_t lcd_fg_buffer[2][LCD_FG_WIDTH * LCD_FG_HEIGHT* 2] ALIGN_32 IN_PSRAM;
static int lcd_fg_buffer_rd_idx;
static display_t disp = {
  .info.is_ld_displayed = 1,
  .info.is_pd_displayed = 0,
};
