avnet-iotconnect/iotc-stm32-n6-demos/Projects/Hand Landmarks/x-cube-n6-ai-hand-landmarks-v1.0.0/Src/app.c
  return (xi != *x) || (yi != *y);
}

static void display_pd_hand(pd_pp_box_t *hand)
{
  int xc, yc;
  int x0, y0;
  int x1, y1;
  int w, h;
  int i;

  /* display box around palm */
  xc = (int)hand->x_center;
  yc = (int)hand->y_center;
  w = (int)hand->width;
  h = (int)hand->height;
  x0 = xc - (w + 1) / 2;
  y0 = yc - (h + 1) / 2;
  x1 = xc + (w + 1) / 2;
  y1 = yc + (h + 1) / 2;
  clamp_point(&x0, &y0);
  clamp_point(&x1, &y1);
  UTIL_LCD_DrawRect(x0, y0, x1 - x0, y1 - y0, UTIL_LCD_COLOR_GREEN);

  /* display palm key points */
  for (i = 0; i < 7; i++) {
    uint32_t color = (i != 0 && i != 2) ? UTIL_LCD_COLOR_RED : UTIL_LCD_COLOR_BLUE;

    x0 = (int)hand->pKps[i].x;
    y0 = (int)hand->pKps[i].y;
    clamp_point(&x0, &y0);
    UTIL_LCD_FillCircle(x0, y0, 2, color);
  }
}

static void rotate_point(float pt[2], float rotation)
{
  float x = pt[0];
  float y = pt[1];

  pt[0] = cos(rotation) * x - sin(rotation) * y;
  pt[1] = sin(rotation) * x + cos(rotation) * y;
}

static void roi_to_corners(roi_t *roi, float corners[4][2])
{
  const float corners_init[4][2] = {
    {-roi->w / 2, -roi->h / 2},
    { roi->w / 2, -roi->h / 2},
    { roi->w / 2,  roi->h / 2},
    {-roi->w / 2,  roi->h / 2},
  };
  int i;

  memcpy(corners, corners_init, sizeof(corners_init));
  /* rotate */
  for (i = 0; i < 4; i++)
    rotate_point(corners[i], roi->rotation);

  /* shift */
  for (i = 0; i < 4; i++) {
    corners[i][0] += roi->cx;
    corners[i][1] += roi->cy;
  }
}

static int clamp_corners(float corners_in[4][2], int corners_out[4][2])
{
  int is_clamp = 0;
  int i;

  for (i = 0; i < 4; i++) {
    corners_out[i][0] = (int)corners_in[i][0];
    corners_out[i][1] = (int)corners_in[i][1];
    is_clamp |= clamp_point(&corners_out[i][0], &corners_out[i][1]);
  }

  return is_clamp;
}

static void display_roi(roi_t *roi)
{
  float corners_f[4][2];
  int corners[4][2];
  int is_clamp;
  int i;

  /* compute box corners */
  roi_to_corners(roi, corners_f);

  /* clamp */
  is_clamp = clamp_corners(corners_f, corners);
  if (is_clamp)
    return ;

  /* display */
  for (i = 0; i < 4; i++)
    UTIL_LCD_DrawLine(corners[i][0], corners[i][1], corners[(i + 1) % 4][0], corners[(i + 1) % 4][1],
                      UTIL_LCD_COLOR_RED);
}

static void decode_ld_landmark(roi_t *roi, ld_point_t *lm, ld_point_t *decoded)
{
  float rotation = roi->rotation;
  float w = roi->w;
  float h = roi->h;

  decoded->x = roi->cx + (lm->x - 0.5) * w * cos(rotation) - (lm->y - 0.5) * h * sin(rotation);
  decoded->y = roi->cy + (lm->x - 0.5) * w * sin(rotation) + (lm->y - 0.5) * h * cos(rotation);
}

static void display_ld_hand(hand_info_t *hand)
{
  const int disk_radius = 2;
  roi_t *roi = &hand->roi;
  int x[LD_LANDMARK_NB];
  int y[LD_LANDMARK_NB];
  int is_clamped[LD_LANDMARK_NB];
  ld_point_t decoded;
  int i;

  for (i = 0; i < LD_LANDMARK_NB; i++) {
    decode_ld_landmark(roi, &hand->ld_landmarks[i], &decoded);
    x[i] = (int)decoded.x;
    y[i] = (int)decoded.y;
    is_clamped[i] = clamp_point_with_margin(&x[i], &y[i], disk_radius);
  }

  for (i = 0; i < LD_LANDMARK_NB; i++) {
    if (is_clamped[i])
      continue;
    UTIL_LCD_FillCircle(x[i], y[i], disk_radius, UTIL_LCD_COLOR_YELLOW);
  }

  for (i = 0; i < LD_BINDING_NB; i++) {
    if (is_clamped[ld_bindings_idx[i][0]] || is_clamped[ld_bindings_idx[i][1]])
      continue;
    UTIL_LCD_DrawLine(x[ld_bindings_idx[i][0]], y[ld_bindings_idx[i][0]],
                      x[ld_bindings_idx[i][1]], y[ld_bindings_idx[i][1]],
                      UTIL_LCD_COLOR_BLACK);
  }
}

void display_hand(display_info_t *info, hand_info_t *hand)
{
  if (info->is_pd_displayed) {
    display_pd_hand(&hand->pd_hands);
    display_roi(&hand->roi);
  }
  if (info->is_ld_displayed)
    display_ld_hand(hand);
}


static void Display_NetworkOutput(display_info_t *info)
{
  float cpu_load_one_second;
  int line_nb = 0;
  float nn_fps;
  int i;

  /* clear previous ui */
  UTIL_LCD_FillRect(lcd_fg_area.X0, lcd_fg_area.Y0, lcd_fg_area.XSize, lcd_fg_area.YSize, 0x00000000); /* Clear previous boxes */

  /* cpu load */
  cpuload_update(&cpu_load);
  cpuload_get_info(&cpu_load, NULL, &cpu_load_one_second, NULL);

	//iotc start
    iot_cpu_percentage = cpu_load_one_second;
	
    /* Update Neural Network Metrics */
    nn_fps = 1000.0 / info->nn_period_ms;
    iot_nn_fps = nn_fps;
    iot_nn_period_ms = info->nn_period_ms;
    iot_pd_ms = info->pd_ms;
    iot_hl_ms = info->hl_ms;
    iot_pd_hand_nb = info->pd_hand_nb;
    iot_pd_max_prob = info->pd_max_prob;
    iot_disp_ms = info->disp_ms;
    //iotc end

  /* draw metrics */
  nn_fps = 1000.0 / info->nn_period_ms;
  UTIL_LCDEx_PrintfAt(0, LINE(line_nb),  RIGHT_MODE, "Cpu load");
  line_nb += 1;
  UTIL_LCDEx_PrintfAt(0, LINE(line_nb),  RIGHT_MODE, "   %.1f%%", cpu_load_one_second);
  line_nb += 2;
  UTIL_LCDEx_PrintfAt(0, LINE(line_nb), RIGHT_MODE, "Inferences");
  line_nb += 1;
  UTIL_LCDEx_PrintfAt(0, LINE(line_nb), RIGHT_MODE, " pd %2ums", info->pd_ms);
  line_nb += 1;
  UTIL_LCDEx_PrintfAt(0, LINE(line_nb), RIGHT_MODE, " hl %2ums", info->hl_ms);
  line_nb += 2;
  UTIL_LCDEx_PrintfAt(0, LINE(line_nb), RIGHT_MODE, "  %.1f FPS", nn_fps);
  line_nb += 2;
  if (DBG_INFO) {
    UTIL_LCDEx_PrintfAt(0, LINE(line_nb), RIGHT_MODE, "Display");
    line_nb += 1;
    UTIL_LCDEx_PrintfAt(0, LINE(line_nb), RIGHT_MODE, "   %ums", info->disp_ms);
    line_nb += 1;
  }
 
  //iotc start
    /* Store hand tracking information */
    if (info->pd_hand_nb > 0 && info->hands[0].is_valid) {
        iot_hand_valid = 1;
        iot_hand_x_center = info->hands[0].roi.cx;
        iot_hand_y_center = info->hands[0].roi.cy;
        iot_hand_width = info->hands[0].roi.w;
        iot_hand_height = info->hands[0].roi.h;
        iot_hand_rotation = info->hands[0].roi.rotation;

        /* Store individual hand landmarks */
        iot_wrist_x = info->hands[0].ld_landmarks[0].x;
        iot_wrist_y = info->hands[0].ld_landmarks[0].y;

        /* Thumb */
        iot_thumb_cmc_x = info->hands[0].ld_landmarks[1].x;
        iot_thumb_cmc_y = info->hands[0].ld_landmarks[1].y;
        iot_thumb_mcp_x = info->hands[0].ld_landmarks[2].x;
        iot_thumb_mcp_y = info->hands[0].ld_landmarks[2].y;
        iot_thumb_ip_x = info->hands[0].ld_landmarks[3].x;
        iot_thumb_ip_y = info->hands[0].ld_landmarks[3].y;
        iot_thumb_tip_x = info->hands[0].ld_landmarks[4].x;
        iot_thumb_tip_y = info->hands[0].ld_landmarks[4].y;

        /* Index Finger */
        iot_index_mcp_x = info->hands[0].ld_landmarks[5].x;
        iot_index_mcp_y = info->hands[0].ld_landmarks[5].y;
        iot_index_pip_x = info->hands[0].ld_landmarks[6].x;
        iot_index_pip_y = info->hands[0].ld_landmarks[6].y;
        iot_index_dip_x = info->hands[0].ld_landmarks[7].x;
        iot_index_dip_y = info->hands[0].ld_landmarks[7].y;
        iot_index_tip_x = info->hands[0].ld_landmarks[8].x;
        iot_index_tip_y = info->hands[0].ld_landmarks[8].y;

        /* Middle Finger */
        iot_middle_mcp_x = info->hands[0].ld_landmarks[9].x;
        iot_middle_mcp_y = info->hands[0].ld_landmarks[9].y;
        iot_middle_pip_x = info->hands[0].ld_landmarks[10].x;
        iot_middle_pip_y = info->hands[0].ld_landmarks[10].y;
        iot_middle_dip_x = info->hands[0].ld_landmarks[11].x;
        iot_middle_dip_y = info->hands[0].ld_landmarks[11].y;
        iot_middle_tip_x = info->hands[0].ld_landmarks[12].x;
        iot_middle_tip_y = info->hands[0].ld_landmarks[12].y;

        /* Ring Finger */
        iot_ring_mcp_x = info->hands[0].ld_landmarks[13].x;
        iot_ring_mcp_y = info->hands[0].ld_landmarks[13].y;
        iot_ring_pip_x = info->hands[0].ld_landmarks[14].x;
        iot_ring_pip_y = info->hands[0].ld_landmarks[14].y;
        iot_ring_dip_x = info->hands[0].ld_landmarks[15].x;
        iot_ring_dip_y = info->hands[0].ld_landmarks[15].y;
        iot_ring_tip_x = info->hands[0].ld_landmarks[16].x;
        iot_ring_tip_y = info->hands[0].ld_landmarks[16].y;

        /* Pinky Finger */
        iot_pinky_mcp_x = info->hands[0].ld_landmarks[17].x;
        iot_pinky_mcp_y = info->hands[0].ld_landmarks[17].y;
        iot_pinky_pip_x = info->hands[0].ld_landmarks[18].x;
        iot_pinky_pip_y = info->hands[0].ld_landmarks[18].y;
        iot_pinky_dip_x = info->hands[0].ld_landmarks[19].x;
        iot_pinky_dip_y = info->hands[0].ld_landmarks[19].y;
        iot_pinky_tip_x = info->hands[0].ld_landmarks[20].x;
        iot_pinky_tip_y = info->hands[0].ld_landmarks[20].y;
    } else {
        iot_hand_valid = 0;
    }
//iotc end

