avnet-iotconnect/iotc-stm32-n6-demos/Projects/Hand Landmarks/x-cube-n6-ai-hand-landmarks-v1.0.0/Src/app.c
  return pd_cook_rotation(pd_normalize_angle(rotation));
}

static void ld_to_roi(ld_point_t lm[LD_LANDMARK_NB], roi_t *roi, pd_pp_box_t *next_pd)
{
  const int pd_to_ld_idx[AI_PD_MODEL_PP_NB_KEYPOINTS] = {0, 5, 9, 13, 17, 1, 2};
  const int indices[] = {0, 1, 2, 3, 5, 6, 9, 10, 13, 14, 17, 18};
  float max_x, max_y, min_x, min_y;
  int i;

  max_x = max_y = -10000;
  min_x = min_y =  10000;

  roi->rotation = ld_compute_rotation(lm);

  for (i = 0; i < ARRAY_NB(indices); i++) {
    max_x = MAX(max_x, lm[indices[i]].x);
    max_y = MAX(max_y, lm[indices[i]].y);
    min_x = MIN(min_x, lm[indices[i]].x);
    min_y = MIN(min_y, lm[indices[i]].y);
  }

  roi->cx = (max_x + min_x) / 2;
  roi->cy = (max_y + min_y) / 2;
  roi->w = (max_x - min_x);
  roi->h = (max_y - min_y);

  next_pd->x_center = roi->cx;
  next_pd->y_center = roi->cy;
  next_pd->width = roi->w;
  next_pd->height = roi->h;
  for (i = 0; i < AI_PD_MODEL_PP_NB_KEYPOINTS; i++) {
    next_pd->pKps[i].x = lm[pd_to_ld_idx[i]].x;
    next_pd->pKps[i].y = lm[pd_to_ld_idx[i]].y;
  }
}

static void compute_next_roi(roi_t *src, ld_point_t lm_in[LD_LANDMARK_NB], roi_t *next, pd_pp_box_t *next_pd)
{
  const float shift_x = 0;
  const float shift_y = -0.1;
  const float scale = 2.0;
  ld_point_t lm[LD_LANDMARK_NB];
  roi_t roi;
  int i;

  for (i = 0; i < LD_LANDMARK_NB; i++)
    decode_ld_landmark(src, &lm_in[i], &lm[i]);

  ld_to_roi(lm, &roi, next_pd);
  roi_shift_and_scale(&roi, shift_x, shift_y, scale, scale);

#if HAS_ROTATION_SUPPORT == 0
  /* In that case we can cancel rotation. This ensure corners are corrected oriented */
  roi.rotation = 0;
#endif

  *next = roi;
}

static void nn_thread_fct(ULONG arg)
{
  float nn_period_filtered_ms = 0;
  float pd_filtered_ms = 0;
  float ld_filtered_ms = 0;
  hl_model_info_t hl_info;
  pd_model_info_t pd_info;
  uint32_t nn_period_ms;
  uint32_t nn_period[2];
  uint8_t *nn_pipe_dst;
  pd_pp_point_t box_next_keypoints[AI_PD_MODEL_PP_NB_KEYPOINTS];
  pd_pp_box_t box_next;
  int is_tracking = 0;
  roi_t roi_next;
  uint32_t pd_ms;
  uint32_t hl_ms;
  int j;

  /* Current tracking algo only support single hand */
  assert(PD_MAX_HAND_NB == 1);

  /* setup models buffer info */
  palm_detector_init(&pd_info);
  box_next.pKps = box_next_keypoints;
  hand_landmark_init(&hl_info);

  /*** App Loop ***************************************************************/
  nn_period[1] = HAL_GetTick();
  nn_pipe_dst = bqueue_get_free(&nn_input_queue, 0);
  assert(nn_pipe_dst);
  CAM_NNPipe_Start(nn_pipe_dst, CMW_MODE_CONTINUOUS);
  while (1)
  {
    uint8_t *capture_buffer;
    int idx_for_resize;

    nn_period[0] = nn_period[1];
    nn_period[1] = HAL_GetTick();
    nn_period_ms = nn_period[1] - nn_period[0];
    nn_period_filtered_ms = USE_FILTERED_TS ? (15 * nn_period_filtered_ms + nn_period_ms) / 16 : nn_period_ms;

    capture_buffer = bqueue_get_ready(&nn_input_queue);
    assert(capture_buffer);
    idx_for_resize = frame_event_nb_for_resize % DISPLAY_BUFFER_NB;

    /* Only start palm detector when not tracking hand */
    if (!is_tracking) {
      is_tracking = palm_detector_run(capture_buffer, &pd_info, &pd_ms);
      box_next.prob = pd_info.pd_out.pOutData[0].prob;
    } else {
      rois[0] = roi_next;
      copy_pd_box(&pd_info.pd_out.pOutData[0], &box_next);
      pd_ms = 0;
    }
    pd_filtered_ms = USE_FILTERED_TS ? (7 * pd_filtered_ms + pd_ms) / 8 : pd_ms;
    bqueue_put_free(&nn_input_queue);

    /* then run hand landmark detector if needed */
    if (is_tracking) {
      hl_ms = HAL_GetTick();
      is_tracking = hand_landmark_run(lcd_bg_buffer[idx_for_resize], &hl_info, &rois[0], ld_landmarks[0]);
      CACHE_OP(SCB_InvalidateDCache_by_Addr(lcd_bg_buffer[idx_for_resize], sizeof(lcd_bg_buffer[idx_for_resize])));
      if (is_tracking)
        compute_next_roi(&rois[0], ld_landmarks[0], &roi_next, &box_next);
      hl_ms = HAL_GetTick() - hl_ms;
    } else {
      hl_ms = 0;
    }
    ld_filtered_ms = USE_FILTERED_TS ? (7 * ld_filtered_ms + hl_ms) / 8 : hl_ms;

    /* update display stats */
    tx_mutex_get(&disp.lock, TX_WAIT_FOREVER);
    disp.info.pd_ms = is_tracking ? 0 : (int)pd_filtered_ms;
    disp.info.hl_ms = is_tracking ? (int)ld_filtered_ms : 0;
    disp.info.nn_period_ms = nn_period_filtered_ms;
    disp.info.pd_hand_nb = is_tracking;
    disp.info.pd_max_prob = pd_info.pd_out.pOutData[0].prob;
    disp.info.hands[0].is_valid = is_tracking;
    copy_pd_box(&disp.info.hands[0].pd_hands, &pd_info.pd_out.pOutData[0]);
    disp.info.hands[0].roi = rois[0];

    #define GESTURE_HISTORY_SIZE 5  // Track last 5 frames

	char gesture_history[GESTURE_HISTORY_SIZE][32]; // Buffer for past gestures
	int gesture_index = 0; // Circular buffer index

    for (j = 0; j < LD_LANDMARK_NB; j++)
        disp.info.hands[0].ld_landmarks[j] = ld_landmarks[0][j];

    // Apply Gesture Smoothing Here
    if (is_tracking) {
        char current_gesture[32] = "Unknown";

        if ((iot_index_tip_y < iot_wrist_y) &&
            (iot_middle_tip_y < iot_wrist_y) &&
            (iot_ring_tip_y < iot_wrist_y) &&
            (iot_pinky_tip_y < iot_wrist_y)) {
            strcpy(current_gesture, "Open Hand");
        }
        else if ((fabs(iot_index_tip_y - iot_wrist_y) < 0.05) &&
                 (fabs(iot_middle_tip_y - iot_wrist_y) < 0.05) &&
                 (fabs(iot_ring_tip_y - iot_wrist_y) < 0.05) &&
                 (fabs(iot_pinky_tip_y - iot_wrist_y) < 0.05)) {
            strcpy(current_gesture, "Fist");
        }
        else if (iot_thumb_tip_y < iot_wrist_y) {
            strcpy(current_gesture, "Thumbs Up");
        }
        else if (iot_thumb_tip_y > iot_wrist_y) {
            strcpy(current_gesture, "Thumbs Down");
        }

        // Store current gesture in circular buffer
        strcpy(gesture_history[gesture_index], current_gesture);
        gesture_index = (gesture_index + 1) % GESTURE_HISTORY_SIZE;

        // Compute the most frequent gesture in history
        int max_count = 0;
        char final_gesture[32] = "Unknown";
        for (int i = 0; i < GESTURE_HISTORY_SIZE; i++) {
            int count = 0;
            for (int j = 0; j < GESTURE_HISTORY_SIZE; j++) {
                if (strcmp(gesture_history[i], gesture_history[j]) == 0) {
                    count++;
                }
            }
            if (count > max_count) {
                max_count = count;
                strcpy(final_gesture, gesture_history[i]);
            }
        }

        // Assign the smoothed gesture
        strcpy(iot_classification, final_gesture);
    }

    tx_mutex_put(&disp.lock);
    tx_semaphore_ceiling_put(&disp.update, 1);
  }
}

static void dp_update_drawing_area()
{
  int ret;

  __disable_irq();
  ret = HAL_LTDC_SetAddress_NoReload(&hlcd_ltdc, (uint32_t) lcd_fg_buffer[lcd_fg_buffer_rd_idx], LTDC_LAYER_2);
  assert(ret == HAL_OK);
  __enable_irq();
}

